

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВидТренировки = Перечисления.ВидТренировки.Сложение;
	МаксЧисло = 10;
	КоличествоПримеров = 10;

КонецПроцедуры

&НаКлиенте
Процедура Старт(Команда)
	
	Если ПроверитьЗаполнение() Тогда
		СтартНаСервере();	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СтартНаСервере()
	
	ПравильныхОтветов = 0;
	НеправильныхОтветов = 0;
	УправлениеФормой(Истина);
	ОбновитьПример();

КонецПроцедуры	

&НаСервере
Процедура ОбновитьПример()
	
	Если (ПравильныхОтветов + НеправильныхОтветов) = КоличествоПримеров Тогда

		ЗавершитьТренировку();

	Иначе

		ДанныеПримера = ОбщегоНазначения.ПолучитьДанныеПримера(МаксЧисло, ВидТренировки);
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеПримера);
		ЗаполнитьЗаголовки(ДанныеПримера.Варианты);

	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗаголовки(Варианты)

	Индексы = Новый Массив;

	Для индекс = 0 По 3 Цикл
		Индексы.Добавить(индекс);
	КонецЦикла;

	Последовательность = Новый Массив;

	Ит = 3;
	Пока Ит > 0 Цикл

		СЧ = ОбщегоНазначения.СлучайноеЧисло(0, Ит);
		Последовательность.Добавить(Индексы[СЧ]);
		Индексы.Удалить(СЧ);
		Ит = Ит - 1;

	КонецЦикла;

	Последовательность.Добавить(Индексы[0]);

	Элементы.Вариант0.Заголовок = Варианты[Последовательность[0]];
	Элементы.Вариант1.Заголовок = Варианты[Последовательность[1]];
	Элементы.Вариант2.Заголовок = Варианты[Последовательность[2]];
	Элементы.Вариант3.Заголовок = Варианты[Последовательность[3]];

КонецПроцедуры

&НаСервере
Процедура ЗавершитьТренировку()
	
	УправлениеФормой(Ложь);
	
	Если ПравильныхОтветов / КоличествоПримеров >= 0.9 Тогда
		Элементы.ДекорацияПобеда.Видимость = Истина;
	Иначе
		Элементы.ДекорацияПоражение.Видимость = Истина;		
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура УправлениеФормой(Тренировка)
	
	Элементы.ГруппаНастройки.Видимость = НЕ Тренировка;
	Элементы.ГруппаТренировка.Видимость = Тренировка;	
	Элементы.ФормаСтарт.Доступность = НЕ Тренировка;	
	
	Если Тренировка Тогда
		Элементы.ДекорацияПобеда.Видимость = Ложь;
		Элементы.ДекорацияПоражение.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Вариант0(Команда)
	
	Если Элементы.Вариант0.Заголовок = ПравильныйОтвет Тогда	
		ПравильныхОтветов = ПравильныхОтветов  + 1;		
	Иначе		
		НеправильныхОтветов = НеправильныхОтветов + 1;		
	КонецЕсли;
	
	ОбновитьПример();

КонецПроцедуры

&НаКлиенте
Процедура Вариант1(Команда)
	
	Если Элементы.Вариант1.Заголовок = ПравильныйОтвет Тогда		
		ПравильныхОтветов = ПравильныхОтветов  + 1;		
	Иначе		
		НеправильныхОтветов = НеправильныхОтветов + 1;		
	КонецЕсли;
	
	ОбновитьПример();

КонецПроцедуры

&НаКлиенте
Процедура Вариант2(Команда)
	
	Если Элементы.Вариант2.Заголовок = ПравильныйОтвет Тогда	
		ПравильныхОтветов = ПравильныхОтветов  + 1;	
	Иначе	
		НеправильныхОтветов = НеправильныхОтветов + 1;	
	КонецЕсли;
	
	ОбновитьПример();

КонецПроцедуры

&НаКлиенте
Процедура Вариант3(Команда)
	
	Если Элементы.Вариант3.Заголовок = ПравильныйОтвет Тогда		
		ПравильныхОтветов = ПравильныхОтветов  + 1;		
	Иначе	
		НеправильныхОтветов = НеправильныхОтветов + 1;	
	КонецЕсли;
	
	ОбновитьПример();

КонецПроцедуры



	